app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "ass motherfucker"], ["commenter", "dog"], ["created_at", Mon, 01 Jul 2013 21:30:44 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 01 Jul 2013 21:30:44 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])