app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"